-- phpMyAdmin SQL Dump
-- version phpStudy 2014
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2017 年 12 月 14 日 13:56
-- 服务器版本: 5.5.53
-- PHP 版本: 5.4.45

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `cloud`
--

-- --------------------------------------------------------

--
-- 表的结构 `cl_comment`
--

CREATE TABLE IF NOT EXISTS `cl_comment` (
  `cid` int(11) NOT NULL AUTO_INCREMENT,
  `comment_bauthor` char(20) NOT NULL,
  `comment_content` varchar(100) NOT NULL,
  `comment_btime` int(11) NOT NULL,
  `comment_to` char(20) NOT NULL,
  PRIMARY KEY (`cid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=35 ;

--
-- 转存表中的数据 `cl_comment`
--

INSERT INTO `cl_comment` (`cid`, `comment_bauthor`, `comment_content`, `comment_btime`, `comment_to`) VALUES
(33, '', '', 1513250632, '261'),
(34, '黄理振', 'dfdf', 1513254011, '264'),
(32, '钟鹏', 'gfhfgjh', 1510749176, '260'),
(31, '钟鹏', 'gdhfgh ', 1510749023, '312'),
(30, '钟鹏', 'dffhg', 1510748874, '261'),
(29, '黄理振', '你好啊~', 1510744392, '261');

-- --------------------------------------------------------

--
-- 表的结构 `cl_db`
--

CREATE TABLE IF NOT EXISTS `cl_db` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `db` varchar(30) NOT NULL,
  `db_user` varchar(20) NOT NULL,
  `db_pass` varchar(20) NOT NULL,
  `applicant` varchar(20) NOT NULL,
  `addtime` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=18 ;

--
-- 转存表中的数据 `cl_db`
--

INSERT INTO `cl_db` (`id`, `db`, `db_user`, `db_pass`, `applicant`, `addtime`) VALUES
(6, 'test', 'myysqlqa', 'qwe123#!@#.,kl/', '', 0),
(5, 'test2', '123@qq.com', '123456', '', 1510281015),
(12, 'test5', '804598148@qq.com', '123456', '黄志坚', 1510667664),
(13, 'test4', '20165528109', '123456', '揭育森', 1510929733),
(14, 'test7', '20165528112', '123456', '钟仕雯', 1510930163),
(15, 'test8', '20165528113', '123456', '刘荣杰', 1510930206),
(16, 'test9', '20165528118', '123456', '陈锦鸿', 1510930446),
(17, 'test10', '20165528117', '123456', '林湘海', 1510931358);

-- --------------------------------------------------------

--
-- 表的结构 `cl_develop`
--

CREATE TABLE IF NOT EXISTS `cl_develop` (
  `did` int(10) NOT NULL AUTO_INCREMENT,
  `title` varchar(20) NOT NULL,
  `content` varchar(100) NOT NULL,
  `addtime` int(11) NOT NULL,
  PRIMARY KEY (`did`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=14 ;

--
-- 转存表中的数据 `cl_develop`
--

INSERT INTO `cl_develop` (`did`, `title`, `content`, `addtime`) VALUES
(1, '云平台V2.0版本发布', '经过了云计算小组的不懈努力，结果你猜，你猜我猜不猜，你猜我猜你猜不猜...经过了云计算小组的不懈努力，结果你猜，你猜我猜不猜，你猜我猜你猜不猜...经过了云计算小组的不懈努力，结果你猜，你猜我猜不猜，', 1599612446),
(2, 'OpenStack、vSphere的部署', '随着用户的访问量增大,功能不能满足需求，我们进行了重大更新，对设计和功能都进行大幅度的升级,增加了原创，欣赏版块', 1491523200),
(3, '学生站点底层数据的处理——Shell脚本', '推出了HTML5 CSS3 官方微博', 1500768000),
(4, '平台架构设计——分布式、高可用、负载均衡', '虽然功能还未健全，但是我们已迫不及待的让它去接受广大用户的火眼金睛', 1500940800),
(5, '平台网站设计——初步框架排版、素材收集、', '在集体探讨下，发现目前的HTML5 CSS3 发展历程已经不能满足需求，集体讨论=，这时候，韩老师之前的设计稿被端上了会议桌。', 1502409600),
(6, 'OpenStack、vSphere、SV', '某天晚上的凌晨三点一刻，预想建立这样一个功能的网站，专为网页设计师。', 1503100800),
(7, '学生站点页面框架设计——个人中心、对外展', '虽然功能还未健全，但是我们已迫不及待的让它去接受广大用户的火眼金睛', 1503273600),
(8, '学生站点——管理后台应用的修改', '代码笔记第一版上线', 1503619200),
(9, '学生站点后端结构设计——评分、评优、留言', '代码笔记第一版上线', 1503792000),
(10, '平台网站设计——优化代码、页面', '代码笔记第一版上线', 1504483200),
(11, '登陆、注册、个人中心的页面设计、导航优化', '代码笔记第一版上线', 1505001600),
(12, '平台外网IP的申请、网速升级', '代码笔记第一版上线', 1505174400),
(13, '云平台的构想与开发人员的洽谈', '由于学了挺多有关系统架构的知识，但苦于没有实际运用起来，因此说干就干。', 1400817250);

-- --------------------------------------------------------

--
-- 表的结构 `cl_document`
--

CREATE TABLE IF NOT EXISTS `cl_document` (
  `did` int(10) NOT NULL AUTO_INCREMENT,
  `doc_title` varchar(20) NOT NULL,
  `doc_link` varchar(20) NOT NULL,
  `addtime` int(11) NOT NULL,
  PRIMARY KEY (`did`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=14 ;

--
-- 转存表中的数据 `cl_document`
--

INSERT INTO `cl_document` (`did`, `doc_title`, `doc_link`, `addtime`) VALUES
(9, 'VSFTP简单搭建教程', 'http://haha.com', 1509971501),
(10, 'Nginx负载均衡、高可用', 'http://xiix.com', 1509971523),
(11, 'LAMP源码安装过程', 'http://keke.com', 1509971548),
(12, 'OpenStack的基本架构', 'http://wowo.com', 1509971568),
(13, '什么是Docker', 'http://dodo.cn', 1509971588);

-- --------------------------------------------------------

--
-- 表的结构 `cl_notice`
--

CREATE TABLE IF NOT EXISTS `cl_notice` (
  `nid` int(10) NOT NULL AUTO_INCREMENT,
  `title` varchar(20) NOT NULL,
  `content` varchar(250) NOT NULL,
  `addtime` int(11) NOT NULL,
  PRIMARY KEY (`nid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=10 ;

--
-- 转存表中的数据 `cl_notice`
--

INSERT INTO `cl_notice` (`nid`, `title`, `content`, `addtime`) VALUES
(1, '注意注意！！！', '由于服务器资源有限，最近暂时不提供分配。', 1509675785),
(2, '平台外网IP的申请、网速升级', '经过了云计算小组的不懈努力，结果你猜，你猜我猜不猜，你猜我猜你猜不猜...经过了云计算小组的不懈努力，结果你猜，你猜我猜不猜，你猜我猜你猜不猜...经过了云计算小组的不懈努力，结果你猜，你猜我猜不猜，', 1509675838),
(9, '服务公告', '1、关于学生站点，因为站点支持解析php文件，所以请同学们不要上传恶意代码攻击服务器，如想挑战云计算小组的技术，经发现，后果自负。br2、由于服务器资源有限，每位同学仅能申请一台云服务器且配置统一。若同一用户通过注册多个账号来“刷资源”，一经查到，将冻结相关账号，请理解！br3、使用过程中若有任何问题请联系管理员：685135', 1510016949);

-- --------------------------------------------------------

--
-- 表的结构 `cl_openstack`
--

CREATE TABLE IF NOT EXISTS `cl_openstack` (
  `oid` int(10) NOT NULL AUTO_INCREMENT,
  `system` char(20) NOT NULL,
  `cpu` char(2) NOT NULL,
  `memory` char(5) NOT NULL,
  `disk` char(5) NOT NULL,
  `application` varchar(100) NOT NULL,
  `applicant` char(20) NOT NULL,
  `state` enum('审核中','已通过','未通过') NOT NULL,
  `postil` varchar(50) NOT NULL,
  `email_state` enum('未通知','已通知') NOT NULL,
  `email_time` int(11) NOT NULL,
  `addtime` int(11) NOT NULL,
  `del_state` varchar(20) NOT NULL,
  `del_notice` varchar(20) NOT NULL,
  `del_why` varchar(100) NOT NULL,
  `del_time` int(11) NOT NULL,
  PRIMARY KEY (`oid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=11 ;

--
-- 转存表中的数据 `cl_openstack`
--

INSERT INTO `cl_openstack` (`oid`, `system`, `cpu`, `memory`, `disk`, `application`, `applicant`, `state`, `postil`, `email_state`, `email_time`, `addtime`, `del_state`, `del_notice`, `del_why`, `del_time`) VALUES
(1, 'CentOS6.8', '1个', '512MB', '10GB', '11121213132yaoyaoayao哟啊', '叶叶', '未通过', '恶意刷资源', '已通知', 0, 1509352499, '', '0', '', 0),
(2, 'CentOS7.2', '1个', '512MB', '10GB', '用来搭建网站服务', 'admin', '审核中', '', '未通知', 0, 1509413328, '', '0', '', 0),
(3, '324', '23', '34', '34', '34', '34', '审核中', '2', '未通知', 0, 0, '', '0', '', 0),
(7, '123', '21', '213', '213', '213', '213', '审核中', '324', '未通知', 0, 0, '已确认销毁', '未通知', '因为不想用了，，。。。。', 0),
(9, 'CentOS6.8', '1个', '512MB', '10GB', 'woyao a ', '黄志坚', '已通过', '好，们可以', '未通知', 0, 1510670963, '', '', '', 0),
(10, 'CentOS6.8', '1个', '512MB', '10GB', '我需要搭建网站', '林湘海', '已通过', '可以满足你的资源申请', '未通知', 0, 1510930806, '', '', '', 0);

-- --------------------------------------------------------

--
-- 表的结构 `cl_reply`
--

CREATE TABLE IF NOT EXISTS `cl_reply` (
  `rid` int(10) NOT NULL AUTO_INCREMENT,
  `reply_bauthor` char(20) NOT NULL,
  `reply_content` varchar(100) NOT NULL,
  `reply_btime` int(10) NOT NULL,
  `reply_to` char(20) NOT NULL,
  PRIMARY KEY (`rid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=56 ;

--
-- 转存表中的数据 `cl_reply`
--

INSERT INTO `cl_reply` (`rid`, `reply_bauthor`, `reply_content`, `reply_btime`, `reply_to`) VALUES
(50, '黄理振', '854154', 1513254129, '32'),
(43, '黄理振', 'hahahahaah', 1513253708, '32'),
(42, '黄理振', 'hehe', 1513253576, '32'),
(36, '钟鹏', '搞不好', 1510744478, '29'),
(35, '钟鹏', '我是房东是个', 1510744430, '29'),
(34, '钟鹏', '胜多负少的个', 1510744414, '29');

-- --------------------------------------------------------

--
-- 表的结构 `cl_score`
--

CREATE TABLE IF NOT EXISTS `cl_score` (
  `sid` int(11) NOT NULL AUTO_INCREMENT,
  `one_score` char(3) NOT NULL DEFAULT '—',
  `two_score` char(3) NOT NULL DEFAULT '—',
  `three_score` char(3) NOT NULL DEFAULT '—',
  `term_score` char(3) NOT NULL DEFAULT '—',
  `to_id` int(11) NOT NULL,
  `name` varchar(15) NOT NULL DEFAULT '学期综合实训',
  PRIMARY KEY (`sid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=10 ;

--
-- 转存表中的数据 `cl_score`
--

INSERT INTO `cl_score` (`sid`, `one_score`, `two_score`, `three_score`, `term_score`, `to_id`, `name`) VALUES
(5, '91', '89', '', '', 2, '学期综合实训'),
(4, '77', '66', '88', '', 1, '学期综合实训'),
(7, '68', '77', '', '', 4, '学期综合实训'),
(8, '99', '', '', '', 12, '学期综合实训'),
(9, '88', '60', '99', '', 260, '学期综合实训');

-- --------------------------------------------------------

--
-- 表的结构 `cl_svn`
--

CREATE TABLE IF NOT EXISTS `cl_svn` (
  `sid` int(10) NOT NULL AUTO_INCREMENT,
  `project_name` char(20) NOT NULL,
  `one_member` char(20) NOT NULL,
  `two_member` char(20) NOT NULL,
  `project_describt` varchar(150) NOT NULL,
  `applicant` char(20) NOT NULL,
  `state` enum('审核中','已通过','未通过') NOT NULL,
  `postil` varchar(50) NOT NULL,
  `email_state` enum('未通知','已通知') NOT NULL,
  `email_time` int(11) NOT NULL,
  `addtime` int(11) NOT NULL,
  `del_state` varchar(20) NOT NULL,
  `del_notice` varchar(20) NOT NULL,
  `del_why` varchar(100) NOT NULL,
  `del_time` int(11) NOT NULL,
  PRIMARY KEY (`sid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=12 ;

--
-- 转存表中的数据 `cl_svn`
--

INSERT INTO `cl_svn` (`sid`, `project_name`, `one_member`, `two_member`, `project_describt`, `applicant`, `state`, `postil`, `email_state`, `email_time`, `addtime`, `del_state`, `del_notice`, `del_why`, `del_time`) VALUES
(1, 'big project', 'jack', 'gogo', 'this is nice project', '叶叶', '未通过', '就不让你通过，哈哈哈', '未通知', 0, 1509350826, '', '', '', 0),
(2, 'shaheichun', 'keke', 'xueer', '我要赶紧昨晚他', 'admin', '已通过', '不错，不错，小伙子，好好干', '未通知', 0, 1509452088, '', '', '', 0),
(3, 'dsaf', 'sdfsd', 'sdfsd', 'sdfds', 'sdfs', '审核中', 'sdf', '未通知', 0, 0, '', '', '', 0),
(7, '4324', '234', '234', '3245', '23556', '审核中', '345', '未通知', 0, 0, '申请中', '未通知', 'buhzidao 不知道', 0),
(8, 'fgds', 'dsfsg', 'gfgff', 'dfgfd', 'dfgdsfsd2', '审核中', 'fsdffsd', '已通知', 0, 0, '申请中', '已通知', 'fdsafasdfdsagdsafg', 0),
(9, '4324', '234', '234', '3245', '235', '审核中', '345', '未通知', 0, 0, '已确认销毁', '未通知', 'buhzidao 不知道', 0),
(11, 'hahaha', '1111', '22222', '测试\r\n！！！！', '黄志坚', '已通过', 'dsfdasf', '未通知', 0, 1510669103, '', '', '', 0);

-- --------------------------------------------------------

--
-- 表的结构 `cl_touchus`
--

CREATE TABLE IF NOT EXISTS `cl_touchus` (
  `tid` int(10) NOT NULL AUTO_INCREMENT,
  `username` varchar(20) NOT NULL,
  `email` char(20) NOT NULL,
  `content` varchar(50) NOT NULL,
  `addtime` int(11) NOT NULL,
  PRIMARY KEY (`tid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=18 ;

--
-- 转存表中的数据 `cl_touchus`
--

INSERT INTO `cl_touchus` (`tid`, `username`, `email`, `content`, `addtime`) VALUES
(1, 'fdsafa', '156456', 'dsa6gf6adsgfdag', 1509519230),
(2, '3453245', '345235234', '64ytryh', 1509522650),
(17, '123456', '45645676', '8888888888832\r\n456+7', 1510760098);

-- --------------------------------------------------------

--
-- 表的结构 `cl_user`
--

CREATE TABLE IF NOT EXISTS `cl_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `email` char(20) NOT NULL,
  `username` char(20) NOT NULL,
  `stu_number` char(20) NOT NULL DEFAULT '#@weGSA1234!@',
  `password` char(20) NOT NULL,
  `qq` varchar(13) NOT NULL,
  `phnumber` varchar(12) NOT NULL,
  `netname` char(20) NOT NULL,
  `netdescribt` char(200) NOT NULL,
  `perdescribt` char(150) NOT NULL,
  `level` int(1) NOT NULL DEFAULT '3',
  `class` enum('0','1','2') NOT NULL DEFAULT '0',
  `excellent` int(2) NOT NULL DEFAULT '0',
  `view` int(5) NOT NULL DEFAULT '0',
  `cre_time` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=364 ;

--
-- 转存表中的数据 `cl_user`
--

INSERT INTO `cl_user` (`id`, `email`, `username`, `stu_number`, `password`, `qq`, `phnumber`, `netname`, `netdescribt`, `perdescribt`, `level`, `class`, `excellent`, `view`, `cre_time`) VALUES
(1, '', 'admin', '#@!fewGS', '0.123', '123', '135312212', '', '', '', 0, '0', 0, 20, 1510389381),
(2, '815326983@qq.com', 'luo', '$@#fwertDF', '123456', '815326983', '676052', '', '', 'luo教授', 1, '0', 0, 1, 1510389381),
(3, '', 'li', '#@fesGHDF', '123456', '0', '0', '', '', '', 1, '0', 0, 0, 1510389381),
(12, '843790329@qq.com', '叶叶', '$#$#fsdaGRE', '123456', '843790329', '2147483647', '我的第一个网站哈哈哈', '很用心很用心在做的一个网站777', '', 3, '0', 0, 1, 1510389381),
(261, '1183342715@qq.com', '钟鹏', '20165528102', '123456', '1183342715', '13413625491', 'Vshow站点', 'Vshow站点提供作品展示', '钟声的钟，大鹏展翅的鹏-钟鹏', 2, '1', 1, 19, 1510389381),
(262, '804598148@qq.com', '黄志坚', '20165528103', '123456', '0', '0', '', '', '', 2, '1', 1, 2, 1510389381),
(263, '776157073@qq.com', '梁锦清', '20165528104', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(264, '767855874@qq.com', '陈林鑫', '20165528105', '123456', '0', '0', '', '', '', 2, '1', 0, 2, 1510389381),
(265, '1370003620@qq.com', '吴荣汉', '20165528106', '123456', '0', '0', '', '', '', 2, '1', 0, 2, 1510389381),
(266, '1041171788@qq.com', '冼沛雄', '20165528107', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(267, '513449525@qq.com', '韦金鹏', '20165528108', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(268, '1150233187@qq.com', '揭育森', '20165528109', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(269, '1373923008@qq.com', '许振杰', '20165528110', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(270, '1051172414@qq.com', '吴思哲', '20165528111', '123456', '0', '0', '', '', '', 2, '1', 0, 1, 1510389381),
(271, '107910770@qq.com', '钟仕雯', '20165528112', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(272, '1594241298@qq.com', '刘荣杰', '20165528113', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(273, '914795561@qq.com', '许洋', '20165528114', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(274, '755978757@qq.com', '邓伟锋', '20165528115', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(275, '1929745912@qq.com', '罗子钊', '20165528116', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(276, '1447360851@qq.com', '林湘海', '20165528117', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(277, '1650023210@qq.com', '陈锦鸿', '20165528118', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(278, '1129891693@qq.com', '陈国坤', '20165528119', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(279, '727081926@qq.com', '陈明志', '20165528120', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(280, '1054786514@qq.com', '曾伟泽', '20165528121', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(281, '1689978322@qq.com', '王临桂', '20165528122', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(282, '1730905401@qq.com', '许锦河', '20165528123', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(283, '2271377687@qq.com', '薛苏苏', '20165528124', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(284, '869997894@qq.com', '马锦涛', '20165528125', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(285, '1613995958@qq.com', '罗湛聪', '20165528126', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(290, '1051108878@qq.com', '苏洪山', '20165528131', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(291, '1343568128@qq.com', '黄培法', '20165528132', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(292, '1649908944@qq.com', '黄国湛', '20165528133', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(293, '864619685@qq.com', '刘志豪', '20165528134', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(294, '861306525@qq.com', '卢怡锵', '20165528135', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(295, '1373961978@qq.com', '何杰', '20165528136', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(296, '1459411738@qq.com', '许晓彤', '20165528137', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(297, '1207989274@qq.com', '李振铭', '20165528138', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(298, '625910145@qq.com', '陈葆曦', '20165528139', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(299, '1151442147@qq.com', '蔡东佑', '20165528140', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(300, '947775816@qq.com', '严创娥', '20165528141', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(301, '993206450@qq.com', '任保勇', '20165528142', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(302, '763184538@qq.com', '胡智盛', '20165528143', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(303, '1055619155@qq.com', '张银铃', '20165528144', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(304, '939306192@qq.com', '李学斌', '20165528145', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(305, '1094940265@qq.com', '邹梓明', '20165528146', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(306, '939165078@qq.com', '郭朝旭', '20165528147', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(307, '1144285537@qq.com', '陈开坚', '20165528148', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(308, '1205128910@qq.com', '纪志杰', '20165528149', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(309, '1153550650@qq.com', '李一鑫', '20165528150', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(310, '810689172@qq.com', '黄飞雄', '20165528151', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(311, '3484447515@qq.com', '徐志康', '20165528152', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(312, '1434319364@qq.com', '杨志辉', '20165528201', '123456', '0', '0', '', '', '', 2, '2', 1, 45, 1510389381),
(313, '3385154608@qq.com', '邬炎茂', '20165528202', '123456', '0', '0', '', '', '', 2, '2', 1, 3, 1510389381),
(314, '2741205472@qq.com', '梁家辉', '20165528203', '123456', '0', '0', '', '', '', 2, '2', 1, 0, 1510389381),
(315, '462122408@qq.com', '陈佐荣', '20165528204', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(260, '2289264229@qq.com', '黄理振', '20165528101', '123456', '2289264229', '15812436052', '个人博客', '这是一个个人博客，用于个人开发学习的实践', '大家好，我是网络专业的黄理振', 2, '1', 1, 13, 1510389381),
(289, '983618722@qq.com', '洪灿佳', '20165528130', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(288, '1490645057@qq.com', '李德正', '20165528129', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(287, '977764668@qq.com', '傅林', '20165528128', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(286, '1902113738@qq.com', '杨孟诚', '20165528127', '123456', '0', '0', '', '', '', 2, '1', 0, 0, 1510389381),
(345, '459835919@qq.com', '黄涛', '20165528234', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(344, '1292822784@qq.com', '方凯彬', '20165528233', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(343, '593898058@qq.com', '简宇宁', '20165528232', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(342, '708922643@qq.com', '张端杰', '20165528231', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(341, '869428696@qq.com', '郑海岸', '20165528230', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(340, '804381912@qq.com', '周昭嘉', '20165528229', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(339, '1430036942@qq.com', '杨锐信', '20165528228', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(338, '614972004@qq.com', '黄春炜', '20165528227', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(337, '568285681@qq.com', '曹世鹏', '20165528226', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(336, '2625514120@qq.com', '曾清云', '20165528225', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(335, '1473242087@qq.com', '胡永兴', '20165528224', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(334, '178553534@qq.com', '于昕怡', '20165528223', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(333, '1765743993@qq.com', '陈俊龙', '20165528222', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(332, '907626976@qq.com', '杨浩潮', '20165528221', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(331, '1033149596@qq.com', '谭志宏', '20165528220', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(330, '1036663909@qq.com', '罗东森', '20165528219', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(329, '838825983@qq.com', '邓志豪', '20165528218', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(328, '2262685208@qq.com', '吕少豪', '20165528217', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(327, '1171361134@qq.com', '谭梅君', '20165528216', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(326, '810048724@qq.com', '吴明伦', '20165528215', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(325, '948145796@qq.com', '封证谦', '20165528214', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(324, '2509631355@qq.com', '梁维绅', '20165528213', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(323, '2747269224@qq.com', '张富春', '20165528212', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(322, '971998401@qq.com', '钟美校', '20165528211', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(321, '1159514579@qq.com', '叶光调', '20165528210', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(320, '1263103919@qq.com', '童运佳', '20165528209', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(319, '1418927482@qq.com', '曾文钰', '20165528208', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(318, '921152526@qq.com', '李杰涛', '20165528207', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(317, '2940162653@qq.com', '胡慧婷', '20165528206', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(316, '736575494@qq.com', '梁广浩', '20165528205', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(362, '1421550312@qq.com', '马增鑫', '20165528251', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(361, '3066821404@qq.com', '张建杰', '20165528250', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(360, '1614876393@qq.com', '余素冰', '20165528249', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(359, '1126488324@qq.com', '胡晋鑫', '20165528248', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(358, '401033503@qq.com', '李家鸿', '20165528247', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(357, '1033097471@qq.com', '陈晓楷', '20165528246', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(356, '627454146@qq.com', '陈洁升', '20165528245', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(355, '493017171@qq.com', '苏冠华', '20165528244', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(354, '1052668716@qq.com', '陈贤', '20165528243', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(353, '1217941110@qq.com', '周子杰', '20165528242', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(352, '1098550269@qq.com', '霍丽芬', '20165528241', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(351, '3120841728@qq.com', '黄建话', '20165528240', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(350, '418526710@qq.com', '沈伟杰', '20165528239', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(349, '1483026491@qq.com', '黎忠典', '20165528238', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(348, '2367929787@qq.com', '黄秀芝', '20165528237', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(347, '2839130158@qq.com', '温华文', '20165528236', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(346, '2209432715@qq.com', '王维财', '20165528235', '123456', '0', '0', '', '', '', 2, '2', 0, 0, 1510389381),
(363, '1300537792@qq.com', '关德辉', '20167715123', '123456', '1300537792', '0', '', '', '', 2, '2', 0, 0, 1539281456);

-- --------------------------------------------------------

--
-- 表的结构 `cl_vsphere`
--

CREATE TABLE IF NOT EXISTS `cl_vsphere` (
  `vid` int(11) NOT NULL AUTO_INCREMENT,
  `system` char(20) NOT NULL,
  `cpu` char(2) NOT NULL,
  `memory` char(5) NOT NULL,
  `disk` char(5) NOT NULL,
  `application` char(200) NOT NULL,
  `applicant` char(20) NOT NULL,
  `state` enum('审核中','已通过','未通过') NOT NULL DEFAULT '审核中',
  `postil` char(70) NOT NULL,
  `email_state` enum('未通知','已通知') NOT NULL DEFAULT '未通知',
  `email_time` int(11) NOT NULL,
  `addtime` int(11) NOT NULL,
  `del_state` varchar(20) NOT NULL,
  `del_notice` varchar(20) NOT NULL,
  `del_why` varchar(100) NOT NULL,
  `del_time` int(11) NOT NULL,
  PRIMARY KEY (`vid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=14 ;

--
-- 转存表中的数据 `cl_vsphere`
--

INSERT INTO `cl_vsphere` (`vid`, `system`, `cpu`, `memory`, `disk`, `application`, `applicant`, `state`, `postil`, `email_state`, `email_time`, `addtime`, `del_state`, `del_notice`, `del_why`, `del_time`) VALUES
(3, 'CentOS6.8', '2个', '1024M', '50GB', 'xiix', 'admin', '已通过', '服务器资源可以满足该用户', '已通知', 0, 0, '', '', '', 0),
(4, 'Windows7x64', '1个', '1024M', '30GB', '我想要', '叶叶', '审核中', '', '已通知', 0, 1509331585, '', '', '', 0),
(5, '23432', '43', '234', '234', '345', '345', '审核中', '345', '未通知', 0, 0, '', '', '', 0),
(9, '324', '32', '534', '43', '234', '3244', '审核中', '234', '未通知', 0, 0, '申请中', '已通知', 'dsfsd', 0),
(13, 'Server2008x64', '1个', '512M', '10GB', 'aaaaaaa', '黄志坚', '已通过', '通过啊！！', '未通知', 0, 1510669705, '', '', '', 0);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
